app/views/orders/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 12]]
---
  <ul>
    <% @order.line_items.each do |item| %>