app/views/orders/showByUser.html.erb

<ul>
  <% @order.line_items.each do |item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 14]]