app/controllers/line_items_controller.rb

  def create
    # Find associated product and current cart
    chosen_product = Product.find(params[:product_id])
    current_cart = @current_cart

    # If cart already has this product then find the relevant line_item and iterate quantity otherwise create a new line_item for this product
    if current_cart.products.include?(chosen_product)
      # Find the line_item with the chosen_product
      @line_item = current_cart.line_items.find_by(:product_id => chosen_product)
      # Iterate the line_item's quantity by one
      @line_item.quantity += 1
    else
      @line_item = LineItem.new
      @line_item.cart = current_cart
      @line_item.quantity = 1
      @line_item.product = chosen_product
    end

    # Save and redirect to cart show path
    @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "products" INNER JOIN "line_items" ON "products"."id" = "line_items"."product_id" WHERE "line_items"."cart_id" = ? AND "products"."id" = ? LIMIT 1  [["cart_id", 1], ["id", 1]]
SELECT  "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ? AND "line_items"."product_id" = 3 LIMIT 1  [["cart_id", 2]]
INSERT INTO "line_items" ("cart_id", "quantity", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 44], ["quantity", 1], ["product_id", 70], ["created_at", "2024-07-31 09:29:17.520436"], ["updated_at", "2024-07-31 09:29:17.520436"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 4], ["updated_at", "2024-07-29 08:14:50.217968"], ["id", 6]]

  def add_quantity
    @line_item = LineItem.find(params[:id])
    @line_item.quantity += 1
    @line_item.save
---
SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2024-07-29 08:08:17.879380"], ["id", 5]]

  def reduce_quantity
    @line_item = LineItem.find(params[:id])
    if @line_item.quantity > 1
      @line_item.quantity -= 1
    end
    @line_item.save
---
SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2024-07-29 08:08:20.176561"], ["id", 5]]