app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = ? LIMIT 1  [["user_id", 7]]
---
  def show_by_user
    @orders = Order.where(:user_id => params[:id])

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 11]]
SELECT line_items.product_id, products.name, sum(line_items.quantity) as sum_line_items FROM "orders" INNER JOIN line_items ON orders.id = line_items.order_id INNER JOIN products ON products.id = line_items.product_id WHERE "orders"."user_id" = ? GROUP BY line_items.product_id  ORDER BY sum_line_items DESC  [["user_id", 11]]
---
  def show_summary_by_user

    @items = nil
    @items = Order.where(:user_id => params[:id]) unless params[:id] == 'all'

    @items = Order
               .joins('INNER JOIN line_items ON orders.id = line_items.order_id')
               .joins('INNER JOIN products ON products.id = line_items.product_id')
               .group('line_items.product_id')
               .select("line_items.product_id, products.name, sum(line_items.quantity) as sum_line_items")
               .order("sum_line_items DESC")

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 3]]
INSERT INTO "orders" ("name", "email", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asd"], ["email", "s@sd"], ["address", "sdasd"], ["created_at", "2024-07-29 09:14:41.634529"], ["updated_at", "2024-07-29 09:14:41.634529"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 6]]
---
  def create
    @order = Order.new(order_params)
    @order.user_id = session[:user_id]
    @current_cart.line_items.each do |item|
      @order.line_items << item
      item.cart_id = nil
    end
    @order.save
    Cart.destroy(session[:cart_id])