app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = ? LIMIT 1  [["user_id", 7]]
---
  def showByUser
    #@order = Order.find(params[:id])
    @order = Order.find_by(:user_id => params[:id])