app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%%')
---
  def search
    @products = Product.where("name LIKE ?", "%#{params[:query]}%")

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "123"], ["price", 22.0], ["created_at", "2024-07-29 07:58:37.640620"], ["updated_at", "2024-07-29 07:58:37.640620"]]
---
  def create
    @product = Product.create(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "products" SET "name" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "car"], ["price", 100000.0], ["updated_at", "2024-08-01 06:38:49.137622"], ["id", 75]]
---
  def update
    @product = Product.find(params[:id])
    @product.update(product_params)