app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sam"], ["password_digest", "$2a$12$L1vZdr.trh5BMd1EUSNW5u3Kc5LWK0wNoSHTPiMsYwUT/.qweWsbO"], ["created_at", "2024-07-29 12:34:07.475545"], ["updated_at", "2024-07-29 12:34:07.475545"]]
---
  def create
    @user = User.new(user_params)

    if @user.save